Epoch: 27
20201202_102446
Accuracy: 0.8864886444286728
Classification Report:
              precision    recall  f1-score   support

           0       0.89      0.96      0.93      9711
           1       0.93      0.67      0.78      2421
           2       0.96      0.88      0.92      7458
           3       0.71      0.67      0.69       200
           4       0.70      0.86      0.77      2754

    accuracy                           0.89     22544
   macro avg       0.84      0.81      0.82     22544
weighted avg       0.89      0.89      0.89     22544

Confusion Matrix:
[[9327   79  101   21  183]
 [ 311 1628  158   21  303]
 [ 412   28 6534    0  484]
 [  29   16    0  134   21]
 [ 370    5    3   14 2362]]
CONFIG:
{'epochs': 50, 'batch_size': 128, 'num_classes': 5, 'num_models': 6, 'dataset': 'kdd', 'train_data': 'train+', 'img_rows': 11, 'img_cols': 11, 'output_dim': 121, 'num_process': 6}
SAMPLE_NUM_PER_LABEL:
{'normal.': [12000, 50], 'ipsweep.': [0, 10], 'nmap.': [0, 0], 'portsweep.': [0, 10], 'satan.': [0, 10], 'saint.': [0, 10], 'mscan.': [0, 10], 'back.': [3000, 10], 'land.': [0, 0], 'neptune.': [3000, 10], 'pod.': [0, 0], 'smurf.': [3000, 10], 'teardrop.': [3000, 0], 'apache2.': [0, 10], 'udpstorm.': [0, 0], 'processtable.': [0, 10], 'mailbomb.': [0, 0], 'buffer_overflow.': [0, 10], 'loadmodule.': [0, 0], 'perl.': [0, 0], 'rootkit.': [0, 10], 'xterm.': [0, 10], 'ps.': [0, 10], 'sqlattack.': [0, 0], 'httptunnel.': [0, 10], 'ftp_write.': [0, 0], 'guess_passwd.': [3000, 10], 'imap.': [3000, 0], 'multihop.': [0, 5], 'phf.': [0, 0], 'spy.': [0, 0], 'warezclient.': [3000, 0], 'warezmaster.': [3000, 10], 'snmpgetattack.': [0, 10], 'named.': [0, 5], 'xlock.': [0, 0], 'xsnoop.': [0, 0], 'sendmail.': [0, 0], 'worm.': [0, 0], 'snmpguess.': [0, 10]}
Model Summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 11, 11, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 11, 11, 4)    40          input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 11, 11, 4)    148         conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 5, 5, 4)      0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 5, 5, 12)     444         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 5, 5, 12)     1308        conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 2, 2, 12)     0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 2, 2, 36)     3924        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 2, 2, 36)     11700       conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 1, 36)     0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 1, 1, 108)    35100       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 1, 1, 108)    105084      conv2d_7[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 108)          0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 216)          23544       flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 121)          26257       dense_1[0][0]                    
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 121)          0           input_1[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 121)          0           dense_2[0][0]                    
                                                                 flatten_2[0][0]                  
==================================================================================================
Total params: 207,549
Trainable params: 207,549
Non-trainable params: 0
__________________________________________________________________________________________________

