Epoch: 41
20201201_154221
Accuracy: 0.8816980127750177
Classification Report:
              precision    recall  f1-score   support

           0       0.93      0.94      0.93      9711
           1       0.90      0.65      0.76      2421
           2       0.91      0.89      0.90      7458
           3       0.23      0.30      0.26       200
           4       0.73      0.90      0.80      2754

    accuracy                           0.88     22544
   macro avg       0.74      0.74      0.73     22544
weighted avg       0.89      0.88      0.88     22544

Confusion Matrix:
[[9124  134  136   18  299]
 [ 100 1583  487   35  216]
 [ 372   33 6645   24  384]
 [  66   16   43   60   15]
 [ 154    0   16  119 2465]]
CONFIG:
{'epochs': 50, 'batch_size': 128, 'num_classes': 5, 'num_models': 6, 'dataset': 'kdd', 'train_data': 'train+', 'img_rows': 11, 'img_cols': 11, 'output_dim': 121, 'num_process': 6}
SAMPLE_NUM_PER_LABEL:
{'normal.': [12000, 10], 'ipsweep.': [0, 2], 'nmap.': [0, 0], 'portsweep.': [0, 2], 'satan.': [0, 2], 'saint.': [0, 2], 'mscan.': [0, 2], 'back.': [3000, 2], 'land.': [0, 0], 'neptune.': [3000, 2], 'pod.': [0, 0], 'smurf.': [3000, 2], 'teardrop.': [3000, 0], 'apache2.': [0, 2], 'udpstorm.': [0, 0], 'processtable.': [0, 2], 'mailbomb.': [0, 0], 'buffer_overflow.': [0, 2], 'loadmodule.': [0, 0], 'perl.': [0, 0], 'rootkit.': [0, 2], 'xterm.': [0, 2], 'ps.': [0, 2], 'sqlattack.': [0, 0], 'httptunnel.': [0, 2], 'ftp_write.': [0, 0], 'guess_passwd.': [3000, 2], 'imap.': [3000, 0], 'multihop.': [0, 1], 'phf.': [0, 0], 'spy.': [0, 0], 'warezclient.': [3000, 0], 'warezmaster.': [3000, 2], 'snmpgetattack.': [0, 2], 'named.': [0, 1], 'xlock.': [0, 0], 'xsnoop.': [0, 0], 'sendmail.': [0, 0], 'worm.': [0, 0], 'snmpguess.': [0, 2]}
Model Summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 11, 11, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 11, 11, 1)    10          input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 11, 11, 4)    40          conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 5, 5, 4)      0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 5, 5, 4)      148         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 5, 5, 12)     444         conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 2, 2, 12)     0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 12)           0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 4)            52          global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 12)           60          dense_1[0][0]                    
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 2, 2, 12)     0           max_pooling2d_2[0][0]            
                                                                 dense_2[0][0]                    
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 2, 2, 12)     1308        multiply_1[0][0]                 
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 2, 2, 36)     3924        conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 1, 36)     0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 36)           0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 12)           444         global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 36)           468         dense_3[0][0]                    
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 1, 1, 36)     0           max_pooling2d_3[0][0]            
                                                                 dense_4[0][0]                    
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 1, 1, 36)     11700       multiply_2[0][0]                 
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 1, 1, 108)    35100       conv2d_7[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 108)          0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 216)          23544       flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 121)          26257       dense_5[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 121)          14762       dense_6[0][0]                    
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 121)          0           input_1[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 121)          0           dense_7[0][0]                    
                                                                 flatten_2[0][0]                  
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 121)          0           input_1[0][0]                    
__________________________________________________________________________________________________
add_2 (Add)                     (None, 121)          0           add_1[0][0]                      
                                                                 flatten_3[0][0]                  
==================================================================================================
Total params: 118,261
Trainable params: 118,261
Non-trainable params: 0
__________________________________________________________________________________________________

