Epoch: 18
20201201_162219
Accuracy: 0.8820085166784953
Classification Report:
              precision    recall  f1-score   support

           0       0.91      0.93      0.92      9711
           1       0.89      0.63      0.74      2421
           2       0.94      0.92      0.93      7458
           3       0.16      0.70      0.26       200
           4       0.84      0.83      0.83      2754

    accuracy                           0.88     22544
   macro avg       0.75      0.80      0.74     22544
weighted avg       0.90      0.88      0.89     22544

Confusion Matrix:
[[9061  144   99   64  343]
 [ 386 1527  322  141   45]
 [ 288   31 6882  238   19]
 [  16   13   11  140   20]
 [ 183    3    3  291 2274]]
CONFIG:
{'epochs': 50, 'batch_size': 128, 'num_classes': 5, 'num_models': 6, 'dataset': 'kdd', 'train_data': 'train+', 'img_rows': 11, 'img_cols': 11, 'output_dim': 121, 'num_process': 6}
SAMPLE_NUM_PER_LABEL:
{'normal.': [12000, 10], 'ipsweep.': [0, 2], 'nmap.': [0, 0], 'portsweep.': [0, 2], 'satan.': [0, 2], 'saint.': [0, 2], 'mscan.': [0, 2], 'back.': [3000, 2], 'land.': [0, 0], 'neptune.': [3000, 2], 'pod.': [0, 0], 'smurf.': [3000, 2], 'teardrop.': [3000, 0], 'apache2.': [0, 2], 'udpstorm.': [0, 0], 'processtable.': [0, 2], 'mailbomb.': [0, 0], 'buffer_overflow.': [0, 2], 'loadmodule.': [0, 0], 'perl.': [0, 0], 'rootkit.': [0, 2], 'xterm.': [0, 2], 'ps.': [0, 2], 'sqlattack.': [0, 0], 'httptunnel.': [0, 2], 'ftp_write.': [0, 0], 'guess_passwd.': [3000, 2], 'imap.': [3000, 0], 'multihop.': [0, 1], 'phf.': [0, 0], 'spy.': [0, 0], 'warezclient.': [3000, 0], 'warezmaster.': [3000, 2], 'snmpgetattack.': [0, 2], 'named.': [0, 1], 'xlock.': [0, 0], 'xsnoop.': [0, 0], 'sendmail.': [0, 0], 'worm.': [0, 0], 'snmpguess.': [0, 2]}
Model Summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 11, 11, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 11, 11, 4)    40          input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 11, 11, 4)    148         conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 5, 5, 4)      0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 5, 5, 12)     444         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 5, 5, 12)     1308        conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 2, 2, 12)     0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 12)           0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 4)            52          global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 12)           60          dense_1[0][0]                    
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 2, 2, 12)     0           max_pooling2d_2[0][0]            
                                                                 dense_2[0][0]                    
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 2, 2, 36)     3924        multiply_1[0][0]                 
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 2, 2, 36)     11700       conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 1, 36)     0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 36)           0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 6)            222         global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 36)           252         dense_3[0][0]                    
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 1, 1, 36)     0           max_pooling2d_3[0][0]            
                                                                 dense_4[0][0]                    
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 1, 1, 108)    35100       multiply_2[0][0]                 
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 1, 1, 108)    105084      conv2d_7[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 108)          0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 216)          23544       flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 121)          26257       dense_5[0][0]                    
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 121)          0           input_1[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 121)          0           dense_6[0][0]                    
                                                                 flatten_2[0][0]                  
==================================================================================================
Total params: 208,135
Trainable params: 208,135
Non-trainable params: 0
__________________________________________________________________________________________________

