Epoch: 49
20201202_090139
Accuracy: 0.8742902767920511
Classification Report:
              precision    recall  f1-score   support

           0       0.88      0.97      0.92      9711
           1       0.87      0.58      0.70      2421
           2       0.94      0.88      0.91      7458
           3       0.60      0.28      0.39       200
           4       0.70      0.83      0.76      2754

    accuracy                           0.87     22544
   macro avg       0.80      0.71      0.74     22544
weighted avg       0.88      0.87      0.87     22544

Confusion Matrix:
[[9377   82   74   23  155]
 [ 478 1412  321    0  210]
 [ 275  102 6590    0  491]
 [  23   20    0   57  100]
 [ 449    9    7   15 2274]]
CONFIG:
{'epochs': 50, 'batch_size': 128, 'num_classes': 5, 'num_models': 6, 'dataset': 'kdd', 'train_data': 'train+', 'img_rows': 11, 'img_cols': 11, 'output_dim': 121, 'num_process': 6}
SAMPLE_NUM_PER_LABEL:
{'normal.': [12000, 100], 'ipsweep.': [0, 20], 'nmap.': [0, 0], 'portsweep.': [0, 20], 'satan.': [0, 20], 'saint.': [0, 20], 'mscan.': [0, 20], 'back.': [3000, 20], 'land.': [0, 0], 'neptune.': [3000, 20], 'pod.': [0, 0], 'smurf.': [3000, 20], 'teardrop.': [3000, 0], 'apache2.': [0, 20], 'udpstorm.': [0, 0], 'processtable.': [0, 20], 'mailbomb.': [0, 0], 'buffer_overflow.': [0, 20], 'loadmodule.': [0, 0], 'perl.': [0, 0], 'rootkit.': [0, 20], 'xterm.': [0, 20], 'ps.': [0, 20], 'sqlattack.': [0, 0], 'httptunnel.': [0, 20], 'ftp_write.': [0, 0], 'guess_passwd.': [3000, 20], 'imap.': [3000, 0], 'multihop.': [0, 10], 'phf.': [0, 0], 'spy.': [0, 0], 'warezclient.': [3000, 0], 'warezmaster.': [3000, 20], 'snmpgetattack.': [0, 20], 'named.': [0, 10], 'xlock.': [0, 0], 'xsnoop.': [0, 0], 'sendmail.': [0, 0], 'worm.': [0, 0], 'snmpguess.': [0, 20]}
Model Summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 11, 11, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 11, 11, 4)    40          input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 11, 11, 4)    148         conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 5, 5, 4)      0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 5, 5, 12)     444         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 5, 5, 12)     1308        conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 2, 2, 12)     0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 2, 2, 36)     3924        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 2, 2, 36)     11700       conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 1, 36)     0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 1, 1, 108)    35100       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 1, 1, 108)    105084      conv2d_7[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 108)          0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 216)          23544       flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 121)          26257       dense_1[0][0]                    
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 121)          0           input_1[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 121)          0           dense_2[0][0]                    
                                                                 flatten_2[0][0]                  
==================================================================================================
Total params: 207,549
Trainable params: 207,549
Non-trainable params: 0
__________________________________________________________________________________________________

